In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('Encoding Technique in ML model.csv')
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [8]:
df.isnull().sum()

Marketing spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# if It has null value then use central tendency to handle null value

In [9]:
mean = df.Transport.mean()
mean

366223.3414285714

In [10]:
median = df.Transport.median()
median

383199.62

In [11]:
#fill null value ,,thus to write: df['Transport'] = df['Transport'].fillna(median)
df.Transport = df.Transport.fillna(median)
df.Transport

0    471784.10
1    443898.53
2    407934.54
3    383199.62
4    366168.42
5    362861.36
6    127716.82
Name: Transport, dtype: float64

In [12]:
df.isnull().sum()

Marketing spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# Encoding technique

In [13]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [14]:
df.Area =df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[3,2,1])
df.Area

0    3
1    2
2    1
3    3
4    1
5    3
6    2
Name: Area, dtype: int64

# Label Encoding

In [15]:
from sklearn.preprocessing import LabelEncoder

In [16]:
df = pd.read_csv('Encoding Technique in ML model.csv')
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [17]:
label = LabelEncoder()

In [18]:
df.Area = label.fit_transform(df['Area'])

In [19]:
df.Area

0    1
1    0
2    2
3    1
4    2
5    1
6    0
Name: Area, dtype: int32

In [20]:
df

   Marketing spend  Administration  Transport  Area       Profit
0        114523.61       136897.80  471784.10     1    192261.83
1        162597.70       151377.59  443898.53     0    191792.06
2        153441.51       101145.55  407934.54     2    191050.39
3        144372.41       118671.85  383199.62     1    182901.99
4        142107.34        91391.77  366168.42     2    166187.94
5        131876.90        99814.71  362861.36     1    158991.12
6        134615.46       147198.87  127716.82     0  15612251.00

In [21]:
#loop for every column
for column in df.columns:
    if df[column].dtype==np.number:
        continue
    df[column] = LabelEncoder().fit_transform(df[column])

C:\Users\MD.NAIM HOSSAIN\AppData\Local\Temp\ipykernel_9408\3862651555.py:3: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype==np.number:

In [22]:
df.Area

0    1
1    0
2    2
3    1
4    2
5    1
6    0
Name: Area, dtype: int64

# One Hot Encoding

In [25]:
df = pd.read_csv('Encoding Technique in ML model.csv')
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [26]:
pd.get_dummies(df['Area'])

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1
5    0      1        0
6    1      0        0

In [27]:
#now deleted a column because ,,stay default if deleted 1 colum

In [34]:
dummy_variable = pd.get_dummies(df['Area'],drop_first=True)
dummy_variable

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1
5      1        0
6      0        0

In [35]:
new_df = df.drop('Area',axis=1)
new_df

   Marketing spend  Administration  Transport       Profit
0        114523.61       136897.80  471784.10    192261.83
1        162597.70       151377.59  443898.53    191792.06
2        153441.51       101145.55  407934.54    191050.39
3        144372.41       118671.85  383199.62    182901.99
4        142107.34        91391.77  366168.42    166187.94
5        131876.90        99814.71  362861.36    158991.12
6        134615.46       147198.87  127716.82  15612251.00

In [36]:
df=pd.concat([new_df,dummy_variable],axis=1) #column niye kaj krle axis=1 hoy

In [37]:
df

   Marketing spend  Administration  Transport       Profit  Dhaka  Rangpur
0        114523.61       136897.80  471784.10    192261.83      1        0
1        162597.70       151377.59  443898.53    191792.06      0        0
2        153441.51       101145.55  407934.54    191050.39      0        1
3        144372.41       118671.85  383199.62    182901.99      1        0
4        142107.34        91391.77  366168.42    166187.94      0        1
5        131876.90        99814.71  362861.36    158991.12      1        0
6        134615.46       147198.87  127716.82  15612251.00      0        0

# Ordinal Encoder

In [38]:
df = pd.read_csv('Encoding Technique in ML model.csv')
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [39]:
from sklearn.preprocessing import OrdinalEncoder

In [40]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [41]:
city_list = ['Dhaka', 'Ctg', 'Rangpur']

In [42]:
ordinal = OrdinalEncoder(categories=[city_list])

In [45]:
encoded_values =ordinal.fit_transform(df[['Area']]) #num of sample and featur niye kaj kre tai 2 dimension nite hbe

In [46]:
encoded_values

array([[0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.]])

In [48]:
new_area = pd.DataFrame(encoded_values,columns=['Area'])
new_area

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   2.0
5   0.0
6   1.0

In [49]:
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [50]:
df.Area = new_area

In [51]:
df

   Marketing spend  Administration  Transport  Area       Profit
0        114523.61       136897.80  471784.10   0.0    192261.83
1        162597.70       151377.59  443898.53   1.0    191792.06
2        153441.51       101145.55  407934.54   2.0    191050.39
3        144372.41       118671.85  383199.62   0.0    182901.99
4        142107.34        91391.77  366168.42   2.0    166187.94
5        131876.90        99814.71  362861.36   0.0    158991.12
6        134615.46       147198.87  127716.82   1.0  15612251.00

# ordinal encoder complet and hashing start

In [52]:
df = pd.read_csv('Encoding Technique in ML model.csv')
df

   Marketing spend  Administration  Transport     Area       Profit
0        114523.61       136897.80  471784.10    Dhaka    192261.83
1        162597.70       151377.59  443898.53      Ctg    191792.06
2        153441.51       101145.55  407934.54  Rangpur    191050.39
3        144372.41       118671.85  383199.62    Dhaka    182901.99
4        142107.34        91391.77  366168.42  Rangpur    166187.94
5        131876.90        99814.71  362861.36    Dhaka    158991.12
6        134615.46       147198.87  127716.82      Ctg  15612251.00

In [54]:
import category_encoders as ce

In [59]:
encoders = ce.HashingEncoder(cols='Area')
encoders

HashingEncoder(cols='Area', max_process=2)

In [60]:
encoders.fit_transform(df)

,col_0,col_1,col_2,col_3,col_4,col_5,col_6,col_7,Marketing spend,Administration,Transport,Profit
0,0,0,0,0,0,1,0,0,114523.61,136897.80,471784.10,192261.83
1,0,1,0,0,0,0,0,0,162597.70,151377.59,443898.53,191792.06
2,0,1,0,0,0,0,0,0,153441.51,101145.55,407934.54,191050.39
3,0,0,0,0,0,1,0,0,144372.41,118671.85,383199.62,182901.99
4,0,1,0,0,0,0,0,0,142107.34,91391.77,366168.42,166187.94
5,0,0,0,0,0,1,0,0,131876.90,99814.71,362861.36,158991.12
6,0,1,0,0,0,0,0,0,134615.46,147198.87,127716.82,15612251.00

In [67]:
encoders = ce.HashingEncoder(cols='Area',n_components=3)
encoders

HashingEncoder(cols='Area', max_process=2, n_components=3)

In [68]:
encoders.fit_transform(df)

,col_0,col_1,col_2,Marketing spend,Administration,Transport,Profit
0,0,1,0,114523.61,136897.80,471784.10,192261.83
1,0,0,1,162597.70,151377.59,443898.53,191792.06
2,1,0,0,153441.51,101145.55,407934.54,191050.39
3,0,1,0,144372.41,118671.85,383199.62,182901.99
4,1,0,0,142107.34,91391.77,366168.42,166187.94
5,0,1,0,131876.90,99814.71,362861.36,158991.12
6,0,0,1,134615.46,147198.87,127716.82,15612251.00

# finished.best techniq one hot encoder .beacause hashing khetre 2 or omre big data jonne miss hoy